tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66j65_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F66J65_H_
#define _PIC18F66J65_H_

#define MISTAT                        0
#define BUSY                          1
#define SCAN                          2
#define NVALID                        3
#define EFLOCON                       4
#define FCEN0                         5
#define FCEN1                         6
#define FULDPXS                       7
#define MACON1                        8
#define MARXEN                        9
#define PASSALL                       10
#define RXPAUS                        11
#define TXPAUS                        12
#define MACON3                        13
#define FULDPX                        14
#define FRMLNEN                       15
#define HFRMEN                        16
#define PHDREN                        17
#define TXCRCEN                       18
#define PADCFG0                       19
#define PADCFG                        20
#define PADCFG1                       21
#define PADCFG2                       22
#define MACON4                        23
#define DEFER                         24
#define MABBIPG                       25
#define BBIPG0                        26
#define BBIPG1                        27
#define BBIPG2                        28
#define BBIPG3                        29
#define BBIPG4                        30
#define BBIPG5                        31
#define BBIPG6                        32
#define MICMD                         33
#define MIIRD                         34
#define MIISCAN                       35
#define ERXFCON                       36
#define BCEN                          37
#define MCEN                          38
#define HTEN                          39
#define MPEN                          40
#define PMEN                          41
#define CRCEN                         42
#define ANDOR                         43
#define UCEN                          44
#define EIE                           45
#define RXERIE                        46
#define TXERIE                        47
#define EIE_TXIE                      48
#define ETXIE                         49
#define LINKIE                        50
#define DMAIE                         51
#define PKTIE                         52
#define ESTAT                         53
#define PHYRDY                        54
#define TXABRT                        55
#define RXBUSY                        56
#define BUFER                         57
#define ECON2                         58
#define ETHEN                         59
#define PKTDEC                        60
#define AUTOINC                       61
#define EIR                           62
#define RXERIF                        63
#define TXERIF                        64
#define EIR_TXIF                      65
#define ETXIF                         66
#define LINKIF                        67
#define DMAIF                         68
#define PKTIF                         69
#define EDATA                         70
#define EDATA0                        71
#define EDATA1                        72
#define EDATA2                        73
#define EDATA3                        74
#define EDATA4                        75
#define EDATA5                        76
#define EDATA6                        77
#define EDATA7                        78
#define ECCP2DEL                      79
#define P2DC0                         80
#define ECCP2DEL_PDC0                 81
#define ECCP2DEL_PDC                  82
#define P2DC1                         83
#define ECCP2DEL_PDC1                 84
#define P2DC2                         85
#define ECCP2DEL_PDC2                 86
#define P2DC3                         87
#define ECCP2DEL_PDC3                 88
#define P2DC4                         89
#define ECCP2DEL_PDC4                 90
#define P2DC5                         91
#define ECCP2DEL_PDC5                 92
#define P2DC6                         93
#define ECCP2DEL_PDC6                 94
#define ECCP2DEL_PRSEN                95
#define P2RSEN                        96
#define ECCP2AS                       97
#define ECCP2AS_PSSBD                 98
#define ECCP2AS_PSSBD0                99
#define PSS2BD0                       100
#define ECCP2AS_PSSBD1                101
#define PSS2BD1                       102
#define PSS2AC0                       103
#define ECCP2AS_PSSAC0                104
#define ECCP2AS_PSSAC                 105
#define ECCP2AS_PSSAC1                106
#define PSS2AC1                       107
#define ECCP2AS_ECCPAS                108
#define ECCP2AS0                      109
#define ECCP2AS_ECCPAS0               110
#define ECCP2AS1                      111
#define ECCP2AS_ECCPAS1               112
#define ECCP2AS2                      113
#define ECCP2AS_ECCPAS2               114
#define ECCP2AS_ECCPASE               115
#define ECCP2ASE                      116
#define ECCP3DEL                      117
#define ECCP3DEL_PDC0                 118
#define P3DC0                         119
#define ECCP3DEL_PDC                  120
#define ECCP3DEL_PDC1                 121
#define P3DC1                         122
#define ECCP3DEL_PDC2                 123
#define P3DC2                         124
#define ECCP3DEL_PDC3                 125
#define P3DC3                         126
#define ECCP3DEL_PDC4                 127
#define P3DC4                         128
#define ECCP3DEL_PDC5                 129
#define P3DC5                         130
#define ECCP3DEL_PDC6                 131
#define P3DC6                         132
#define P3RSEN                        133
#define ECCP3DEL_PRSEN                134
#define ECCP3AS                       135
#define ECCP3AS_PSSBD0                136
#define PSS3BD0                       137
#define ECCP3AS_PSSBD                 138
#define ECCP3AS_PSSBD1                139
#define PSS3BD1                       140
#define ECCP3AS_PSSAC0                141
#define PSS3AC0                       142
#define ECCP3AS_PSSAC                 143
#define ECCP3AS_PSSAC1                144
#define PSS3AC1                       145
#define ECCP3AS_ECCPAS0               146
#define ECCP3AS_ECCPAS                147
#define ECCP3AS0                      148
#define ECCP3AS_ECCPAS1               149
#define ECCP3AS1                      150
#define ECCP3AS_ECCPAS2               151
#define ECCP3AS2                      152
#define ECCP3AS_ECCPASE               153
#define ECCP3ASE                      154
#define CCP5CON                       155
#define CCP5M0                        156
#define CCP5M                         157
#define CCP5M1                        158
#define CCP5M2                        159
#define CCP5M3                        160
#define CCP5Y                         161
#define DC5B0                         162
#define DC5B                          163
#define CCP5X                         164
#define DC5B1                         165
#define CCP4CON                       166
#define CCP4M                         167
#define CCP4M0                        168
#define CCP4M1                        169
#define CCP4M2                        170
#define CCP4M3                        171
#define CCP4Y                         172
#define DC4B0                         173
#define DC4B                          174
#define CCP4X                         175
#define DC4B1                         176
#define T4CON                         177
#define T4CKPS0                       178
#define T4CKPS                        179
#define T4CKPS1                       180
#define TMR4ON                        181
#define T4OUTPS                       182
#define T4OUTPS0                      183
#define T4OUTPS1                      184
#define T4OUTPS2                      185
#define T4OUTPS3                      186
#define ECCP1DEL                      187
#define P1DC0                         188
#define ECCP1DEL_PDC0                 189
#define ECCP1DEL_PDC                  190
#define P1DC1                         191
#define ECCP1DEL_PDC1                 192
#define P1DC2                         193
#define ECCP1DEL_PDC2                 194
#define P1DC3                         195
#define ECCP1DEL_PDC3                 196
#define P1DC4                         197
#define ECCP1DEL_PDC4                 198
#define P1DC5                         199
#define ECCP1DEL_PDC5                 200
#define P1DC6                         201
#define ECCP1DEL_PDC6                 202
#define P1RSEN                        203
#define ECCP1DEL_PRSEN                204
#define BAUDCON1                      205
#define ABDEN1                        206
#define ABDEN                         207
#define WUE1                          208
#define W4E                           209
#define WUE                           210
#define BRG161                        211
#define BRG16                         212
#define CKTXP                         213
#define SCKP1                         214
#define TXCKP                         215
#define TXCKP1                        216
#define SCKP                          217
#define DTRXP1                        218
#define RXDTP1                        219
#define DTRXP                         220
#define RXCKP                         221
#define RXDTP                         222
#define RCMT1                         223
#define RCIDL1                        224
#define RCIDL                         225
#define RCMT                          226
#define ABDOVF                        227
#define ABDOVF1                       228
#define PORTA                         229
#define ULPWUIN                       230
#define AN0                           231
#define PORTA_RA0                     232
#define LEDA                          233
#define AN1                           234
#define PORTA_RA1                     235
#define LEDB                          236
#define AN2                           237
#define PORTA_RA2                     238
#define VREFM                         239
#define AN3                           240
#define PORTA_RA3                     241
#define VREFP                         242
#define PORTA_RA4                     243
#define T0CKI                         244
#define AN4                           245
#define PORTA_RA5                     246
#define LVDIN                         247
#define PORTB                         248
#define FLT0                          249
#define INT0                          250
#define PORTB_RB0                     251
#define INT1                          252
#define PORTB_RB1                     253
#define INT2                          254
#define PORTB_RB2                     255
#define INT3                          256
#define CCP2_PA2                      257
#define PORTB_RB3                     258
#define KBI0                          259
#define PORTB_RB4                     260
#define KBI1                          261
#define PORTB_RB5                     262
#define PGC                           263
#define KBI2                          264
#define PORTB_RB6                     265
#define PGD                           266
#define KBI3                          267
#define PORTB_RB7                     268
#define PORTC                         269
#define T13CKI                        270
#define T1OSO                         271
#define PORTC_RC0                     272
#define CCP2                          273
#define T1OSI                         274
#define ECCP2                         275
#define PA2                           276
#define PORTC_RC1                     277
#define CCP1                          278
#define ECCP1                         279
#define PA1                           280
#define PORTC_RC2                     281
#define SCK1                          282
#define SCL                           283
#define SCL1                          284
#define SCK                           285
#define PORTC_RC3                     286
#define SDI1                          287
#define SDA1                          288
#define SDA                           289
#define SDI                           290
#define PORTC_RC4                     291
#define SDO1                          292
#define SDO                           293
#define PORTC_RC5                     294
#define TX                            295
#define PORTC_RC6                     296
#define CK                            297
#define TX1                           298
#define CK1                           299
#define DT                            300
#define RX                            301
#define RX1                           302
#define DT1                           303
#define PORTC_RC7                     304
#define PORTD                         305
#define PORTD_RD0                     306
#define PORTD_RD1                     307
#define ECCP3                         308
#define CCP3                          309
#define PORTD_RD2                     310
#define CCP4                          311
#define PORTE                         312
#define PD2                           313
#define RDE                           314
#define PORTE_RE0                     315
#define WRE                           316
#define PORTE_RE1                     317
#define PC2                           318
#define CCP10                         319
#define PB2                           320
#define CS                            321
#define PORTE_RE2                     322
#define CCP9E                         323
#define PORTE_RE3                     324
#define PC3E                          325
#define PB3E                          326
#define PORTE_RE4                     327
#define CCP8E                         328
#define CCP7E                         329
#define PORTE_RE5                     330
#define PC1E                          331
#define PORTF                         332
#define PORTF_RF1                     333
#define C2OUTF                        334
#define AN6                           335
#define PORTF_RF2                     336
#define AN7                           337
#define C1OUTF                        338
#define PORTF_RF3                     339
#define AN8                           340
#define PORTF_RF4                     341
#define AN9                           342
#define PORTF_RF5                     343
#define CVREF                         344
#define AN10                          345
#define PORTF_RF6                     346
#define AN11                          347
#define PORTF_RF7                     348
#define SS1                           349
#define nSS1                          350
#define NOT_SS1                       351
#define nSS                           352
#define NOT_SS                        353
#define SS                            354
#define PORTG                         355
#define CCP5                          356
#define PORTG_RG4                     357
#define LATA                          358
#define LATA0                         359
#define LA0                           360
#define LATA1                         361
#define LA1                           362
#define LATA2                         363
#define LA2                           364
#define LATA3                         365
#define LA3                           366
#define LATA4                         367
#define LA4                           368
#define LATA5                         369
#define LA5                           370
#define REPU                          371
#define LA6                           372
#define LATA7                         373
#define RDPU                          374
#define LA7                           375
#define LATB                          376
#define LB0                           377
#define LATB0                         378
#define LB1                           379
#define LATB1                         380
#define LB2                           381
#define LATB2                         382
#define LB3                           383
#define LATB3                         384
#define LB4                           385
#define LATB4                         386
#define LB5                           387
#define LATB5                         388
#define LB6                           389
#define LATB6                         390
#define LB7                           391
#define LATB7                         392
#define LATC                          393
#define LATC0                         394
#define LC0                           395
#define LATC1                         396
#define LC1                           397
#define LATC2                         398
#define LC2                           399
#define LATC3                         400
#define LC3                           401
#define LATC4                         402
#define LC4                           403
#define LATC5                         404
#define LC5                           405
#define LATC6                         406
#define LC6                           407
#define LATC7                         408
#define LC7                           409
#define LATD                          410
#define LATD0                         411
#define LD0                           412
#define LATD1                         413
#define LD1                           414
#define LATD2                         415
#define LD2                           416
#define LATE                          417
#define LATE0                         418
#define LE0                           419
#define LATE1                         420
#define LE1                           421
#define LATE2                         422
#define LE2                           423
#define LATE3                         424
#define LE3                           425
#define LATE4                         426
#define LE4                           427
#define LATE5                         428
#define LE5                           429
#define LATF                          430
#define LATF1                         431
#define LF1                           432
#define LF2                           433
#define LATF2                         434
#define LF3                           435
#define LATF3                         436
#define LF4                           437
#define LATF4                         438
#define LF5                           439
#define LATF5                         440
#define LF6                           441
#define LATF6                         442
#define LF7                           443
#define LATF7                         444
#define LATG                          445
#define LATG4                         446
#define LG4                           447
#define TRISA                         448
#define TRISA_RA0                     449
#define TRISA0                        450
#define TRISA_RA1                     451
#define TRISA1                        452
#define TRISA2                        453
#define TRISA_RA2                     454
#define TRISA_RA3                     455
#define TRISA3                        456
#define TRISA_RA4                     457
#define TRISA4                        458
#define TRISA_RA5                     459
#define TRISA5                        460
#define TRISB                         461
#define TRISB_RB0                     462
#define TRISB0                        463
#define TRISB_RB1                     464
#define TRISB1                        465
#define TRISB_RB2                     466
#define TRISB2                        467
#define TRISB_RB3                     468
#define TRISB3                        469
#define TRISB_RB4                     470
#define TRISB4                        471
#define TRISB_RB5                     472
#define TRISB5                        473
#define TRISB_RB6                     474
#define TRISB6                        475
#define TRISB_RB7                     476
#define TRISB7                        477
#define TRISC                         478
#define TRISC0                        479
#define TRISC_RC0                     480
#define TRISC1                        481
#define TRISC_RC1                     482
#define TRISC2                        483
#define TRISC_RC2                     484
#define TRISC3                        485
#define TRISC_RC3                     486
#define TRISC4                        487
#define TRISC_RC4                     488
#define TRISC5                        489
#define TRISC_RC5                     490
#define TRISC6                        491
#define TRISC_RC6                     492
#define TRISC7                        493
#define TRISC_RC7                     494
#define TRISD                         495
#define TRISD0                        496
#define TRISD_RD0                     497
#define TRISD1                        498
#define TRISD_RD1                     499
#define TRISD2                        500
#define TRISD_RD2                     501
#define TRISE                         502
#define TRISE_RE0                     503
#define TRISE0                        504
#define TRISE1                        505
#define TRISE_RE1                     506
#define TRISE_RE2                     507
#define TRISE2                        508
#define TRISE_RE3                     509
#define TRISE3                        510
#define TRISE_RE4                     511
#define TRISE4                        512
#define TRISE_RE5                     513
#define TRISE5                        514
#define TRISF                         515
#define TRISF_RF1                     516
#define TRISF1                        517
#define TRISF2                        518
#define TRISF_RF2                     519
#define TRISF_RF3                     520
#define TRISF3                        521
