tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66j65_tdd.h
#define TRISF_RF4                     522
#define TRISF4                        523
#define TRISF_RF5                     524
#define TRISF5                        525
#define TRISF_RF6                     526
#define TRISF6                        527
#define TRISF7                        528
#define TRISF_RF7                     529
#define TRISG                         530
#define TRISG4                        531
#define TRISG_RG4                     532
#define OSCTUNE                       533
#define TUN4                          534
#define PPRE                          535
#define TUN5                          536
#define PPST0                         537
#define PLLEN                         538
#define PPST1                         539
#define PIE1                          540
#define TMR1IE                        541
#define TMR2IE                        542
#define CCP1IE                        543
#define SSP1IE                        544
#define SSPIE                         545
#define PIE1_TXIE                     546
#define TX1IE                         547
#define RC1IE                         548
#define RCIE                          549
#define ADIE                          550
#define PIR1                          551
#define TMR1IF                        552
#define TMR2IF                        553
#define CCP1IF                        554
#define SSPIF                         555
#define SSP1IF                        556
#define PIR1_TXIF                     557
#define TX1IF                         558
#define RCIF                          559
#define RC1IF                         560
#define ADIF                          561
#define IPR1                          562
#define TMR1IP                        563
#define TMR2IP                        564
#define CCP1IP                        565
#define SSPIP                         566
#define SSP1IP                        567
#define TX1IP                         568
#define TXIP                          569
#define RCIP                          570
#define RC1IP                         571
#define ADIP                          572
#define PIE2                          573
#define CCP2IE                        574
#define TMR3IE                        575
#define BCL1IE                        576
#define BCLIE                         577
#define ETHIE                         578
#define CMIE                          579
#define OSCFIE                        580
#define PIR2                          581
#define CCP2IF                        582
#define TMR3IF                        583
#define BCL1IF                        584
#define BCLIF                         585
#define ETHIF                         586
#define CMIF                          587
#define OSCFIF                        588
#define IPR2                          589
#define CCP2IP                        590
#define TMR3IP                        591
#define BCLIP                         592
#define BCL1IP                        593
#define ETHIP                         594
#define CMIP                          595
#define OSCFIP                        596
#define PIE3                          597
#define CCP3IE                        598
#define RXB0IE                        599
#define RXBNIE                        600
#define RXB1IE                        601
#define CCP4IE                        602
#define TXB0IE                        603
#define CCP5IE                        604
#define TMR4IE                        605
#define TXB1IE                        606
#define PIR3                          607
#define CCP3IF                        608
#define CCP4IF                        609
#define RXBNIF                        610
#define CCP5IF                        611
#define TMR4IF                        612
#define IPR3                          613
#define CCP3IP                        614
#define RXBNIP                        615
#define CCP4IP                        616
#define CCP5IP                        617
#define TMR4IP                        618
#define EECON1                        619
#define WR                            620
#define WREN                          621
#define WRERR                         622
#define FREE                          623
#define RCSTA1                        624
#define RX9D                          625
#define RX9D1                         626
#define RCD8                          627
#define OERR1                         628
#define OERR                          629
#define FERR                          630
#define FERR1                         631
#define ADDEN                         632
#define ADDEN1                        633
#define CREN1                         634
#define CREN                          635
#define SREN                          636
#define SRENA                         637
#define SREN1                         638
#define RX9                           639
#define RC8_9                         640
#define nRC8                          641
#define NOT_RC8                       642
#define RC9                           643
#define RX91                          644
#define SPEN                          645
#define SPEN1                         646
#define TXSTA1                        647
#define TXD8                          648
#define TX9D1                         649
#define TX9D                          650
#define TRMT                          651
#define TRMT1                         652
#define BRGH1                         653
#define BRGH                          654
#define SENDB1                        655
#define SENDB                         656
#define SYNC                          657
#define SYNC1                         658
#define TXEN                          659
#define TXEN1                         660
#define TX91                          661
#define TX8_9                         662
#define TX9                           663
#define NOT_TX8                       664
#define nTX8                          665
#define CSRC1                         666
#define CSRC                          667
#define T3CON                         668
#define TMR3ON                        669
#define TMR3CS                        670
#define nT3SYNC                       671
#define NOT_T3SYNC                    672
#define T3SYNC                        673
#define T3INSYNC                      674
#define SOSCEN3                       675
#define T3CCP1                        676
#define T3CKPS                        677
#define T3CKPS0                       678
#define T3CKPS1                       679
#define T3CCP2                        680
#define T3CON_RD16                    681
#define RD163                         682
#define T3RD16                        683
#define CMCON                         684
#define CMCON_CM                      685
#define CMEN0                         686
#define CM0                           687
#define CMEN1                         688
#define CM1                           689
#define CMEN2                         690
#define CM2                           691
#define CIS                           692
#define C1INV                         693
#define C2INV                         694
#define C1OUT                         695
#define C2OUT                         696
#define CVRCON                        697
#define CVR                           698
#define CVR0                          699
#define CVR1                          700
#define CVR2                          701
#define CVR3                          702
#define CVRSS                         703
#define CVRR                          704
#define CVROEN                        705
#define CVROE                         706
#define CVREN                         707
#define ECCP1AS                       708
#define ECCP1AS_PSSBD                 709
#define ECCP1AS_PSSBD0                710
#define PSS1BD0                       711
#define ECCP1AS_PSSBD1                712
#define PSS1BD1                       713
#define ECCP1AS_PSSAC0                714
#define PSS1AC0                       715
#define ECCP1AS_PSSAC                 716
#define ECCP1AS_PSSAC1                717
#define PSS1AC1                       718
#define ECCP1AS_ECCPAS0               719
#define ECCP1AS_ECCPAS                720
#define ECCP1AS0                      721
#define ECCP1AS_ECCPAS1               722
#define ECCP1AS1                      723
#define ECCP1AS_ECCPAS2               724
#define ECCP1AS2                      725
#define ECCP1ASE                      726
#define ECCP1AS_ECCPASE               727
#define CCP3CON                       728
#define CCP3M                         729
#define CCP3M0                        730
#define CCP3M1                        731
#define CCP3M2                        732
#define CCP3M3                        733
#define CCP3Y                         734
#define DC3B                          735
#define DC3B0                         736
#define DC3B1                         737
#define CCP3X                         738
#define P3M                           739
#define P3M0                          740
#define P3M1                          741
#define CCP2CON                       742
#define CCP2M                         743
#define CCP2M0                        744
#define CCP2M1                        745
#define CCP2M2                        746
#define CCP2M3                        747
#define DC2B                          748
#define DC2B0                         749
#define CCP2Y                         750
#define DC2B1                         751
#define CCP2X                         752
#define P2M                           753
#define P2M0                          754
#define P2M1                          755
#define CCP1CON                       756
#define CCP1M0                        757
#define CCP1M                         758
#define CCP1M1                        759
#define CCP1M2                        760
#define CCP1M3                        761
#define CCP1Y                         762
#define DC1B                          763
#define DC1B0                         764
#define CCP1X                         765
#define DC1B1                         766
#define P1M                           767
#define P1M0                          768
#define P1M1                          769
#define ADCON2                        770
#define ADCS0                         771
#define ADCS                          772
#define ADCS1                         773
#define ADCS2                         774
#define ACQT0                         775
#define ACQT                          776
#define ACQT1                         777
#define ACQT2                         778
#define ADFM                          779
#define ADCON1                        780
#define PCFG0                         781
#define PCFG                          782
#define PCFG1                         783
#define PCFG2                         784
#define CHSN3                         785
#define PCFG3                         786
#define VCFG                          787
#define VCFG0                         788
#define VCFG01                        789
#define VCFG11                        790
#define VCFG1                         791
#define ADCON0                        792
#define ADON                          793
#define nDONE                         794
#define GO_nDONE                      795
#define NOT_DONE                      796
#define GODONE                        797
#define GO_DONE                       798
#define DONE                          799
#define GO_NOT_DONE                   800
#define GO                            801
#define CHS0                          802
#define CHS                           803
#define CHS1                          804
#define CHS2                          805
#define CHS3                          806
#define ADCAL                         807
#define SSP1CON2                      808
#define SEN1                          809
#define SEN                           810
#define ADMSK11                       811
#define ADMSK                         812
#define RSEN1                         813
#define RSEN                          814
#define ADMSK1                        815
#define PEN                           816
#define ADMSK21                       817
#define PEN1                          818
#define ADMSK2                        819
#define ADMSK31                       820
#define RCEN                          821
#define RCEN1                         822
#define ADMSK3                        823
#define ACKEN                         824
#define ACKEN1                        825
#define ADMSK41                       826
#define ADMSK4                        827
#define ACKDT1                        828
#define ADMSK51                       829
#define ADMSK5                        830
#define ACKDT                         831
#define ACKSTAT                       832
#define ACKSTAT1                      833
#define GCEN                          834
#define GCEN1                         835
#define SSP1CON1                      836
#define SSPM0                         837
#define SSPM                          838
#define SSPM01                        839
#define SSPM1                         840
#define SSPM11                        841
#define SSPM2                         842
#define SSPM21                        843
#define SSPM31                        844
#define SSPM3                         845
#define CKP                           846
#define CKP1                          847
#define SSPEN                         848
#define SSPEN1                        849
#define SSPOV1                        850
#define SSPOV                         851
#define WCOL1                         852
#define WCOL                          853
#define SSP1STAT                      854
#define BF                            855
#define BF1                           856
#define UA1                           857
#define UA                            858
#define R_NOT_W                       859
#define READ_WRITE                    860
#define RW1                           861
#define NOT_W                         862
#define R_W                           863
#define nW                            864
#define RW                            865
#define nWRITE                        866
#define R                             867
#define NOT_WRITE                     868
#define R_nW                          869
#define I2C_READ                      870
#define START                         871
#define START1                        872
#define S                             873
#define I2C_START                     874
#define STOP                          875
#define STOP1                         876
#define I2C_STOP                      877
#define P                             878
#define NOT_A                         879
#define DATA_ADDRESS                  880
#define nA                            881
#define D_A                           882
#define D_nA                          883
#define D                             884
#define DA1                           885
#define DA                            886
#define D_NOT_A                       887
#define NOT_ADDRESS                   888
#define nADDRESS                      889
#define I2C_DAT                       890
#define CKE                           891
#define CKE1                          892
#define SMP                           893
#define SMP1                          894
#define SSP1ADD                       895
#define MSK01                         896
#define MSK0                          897
#define MSK11                         898
#define MSK1                          899
#define MSK21                         900
#define MSK2                          901
#define MSK3                          902
#define MSK31                         903
#define MSK4                          904
#define MSK41                         905
#define MSK51                         906
#define MSK5                          907
#define MSK61                         908
#define MSK6                          909
#define MSK71                         910
#define MSK7                          911
#define T2CON                         912
#define T2CKPS0                       913
#define T2CKPS                        914
#define T2CKPS1                       915
#define TMR2ON                        916
#define T2OUTPS0                      917
#define TOUTPS                        918
#define T2OUTPS1                      919
#define T2OUTPS2                      920
#define T2OUTPS3                      921
#define PR2                           922
#define WM0                           923
#define WM1                           924
#define WAIT0                         925
#define WAIT1                         926
#define EBDIS                         927
#define T1CON                         928
#define TMR1ON                        929
#define TMR1CS                        930
#define NOT_T1SYNC                    931
#define T1SYNC                        932
#define nT1SYNC                       933
#define T1INSYNC                      934
#define T1OSCEN                       935
#define SOSCEN                        936
#define T1CKPS0                       937
#define T1CKPS                        938
#define T1CKPS1                       939
#define T1RUN                         940
#define T1RD16                        941
#define T1CON_RD16                    942
#define RCON                          943
#define BOR                           944
#define NOT_BOR                       945
#define nBOR                          946
#define POR                           947
#define nPOR                          948
#define NOT_POR                       949
#define PD                            950
#define nPD                           951
#define NOT_PD                        952
#define nTO                           953
#define TO                            954
#define NOT_TO                        955
#define nRI                           956
#define NOT_RI                        957
#define RI                            958
#define NOT_CM                        959
#define RCON_CM                       960
#define nCM                           961
#define IPEN                          962
#define WDTCON                        963
#define SWDTE                         964
#define SWDTEN                        965
#define ECON1                         966
#define RXEN                          967
#define TXRTS                         968
#define CSUMEN                        969
#define DMAST                         970
#define RXRST                         971
#define TXRST                         972
#define OSCCON                        973
#define SCS0                          974
#define SCS                           975
#define SCS1                          976
#define OSTS                          977
#define IDLEN                         978
#define T0CON                         979
#define T0PS                          980
#define T0PS0                         981
#define T0PS1                         982
#define T0PS2                         983
#define PSA                           984
#define T0SE                          985
#define T0CS                          986
#define T08BIT                        987
#define TMR0ON                        988
#define STATUS                        989
#define C                             990
#define CARRY                         991
#define DC                            992
#define ZERO                          993
#define Z                             994
#define OV                            995
#define OVERFLOW                      996
#define N                             997
#define NEGATIVE                      998
#define INTCON3                       999
#define INT1IF                        1000
#define INT1F                         1001
#define INT2IF                        1002
#define INT2F                         1003
#define INT3F                         1004
#define INT3IF                        1005
#define INT1E                         1006
#define INT1IE                        1007
#define INT2IE                        1008
#define INT2E                         1009
#define INT3E                         1010
#define INT3IE                        1011
#define INT1P                         1012
#define INT1IP                        1013
#define INT2IP                        1014
#define INT2P                         1015
#define INTCON2                       1016
#define RBIP                          1017
#define INT3IP                        1018
#define TMR0IP                        1019
#define T0IP                          1020
#define INTEDG3                       1021
#define INTEDG2                       1022
#define INTEDG1                       1023
#define INTEDG0                       1024
#define RBPU                          1025
#define NOT_RBPU                      1026
#define nRBPU                         1027
#define INTCON                        1028
#define RBIF                          1029
#define INT0F                         1030
#define INT0IF                        1031
#define T0IF                          1032
#define TMR0IF                        1033
#define RBIE                          1034
#define INT0E                         1035
#define INT0IE                        1036
#define T0IE                          1037
#define TMR0IE                        1038
#define PEIE                          1039
#define PEIE_GIEL                     1040
#define GIEL                          1041
#define GIE_GIEH                      1042
#define GIE                           1043
#define GIEH                          1044
#define STKPTR0                       1045
#define STKPTR                        1046
#define SP0                           1047
#define STKPTR1                       1048
#define SP1                           1049
#define STKPTR2                       1050
#define SP2                           1051
#define SP3                           1052
#define STKPTR3                       1053
#define STKPTR4                       1054
#define SP4                           1055
#define STKUNF                        1056
#define STKOVF                        1057
#define STKFUL                        1058

#endif // _PIC18F66J65_H_
